// my local map or api
var list = {
    item:[{
            img :'Images/كشري.jpg',
            nameOfmeal: 'كشري',
            intgra:' المكونات :',
            disc :`½1 كوب معكرونة مسلوقة
            ½1 كوب أرز
            1 كوب عدس أسمر
            1 كوب حمص مسلوق
            2 طماطم مقشرة ومهروسة
            2 بصل
            2 مكعب مرق دجاج
            2 ملعقة كبيرة معجون طماطم
            ½ كوب شعيرية
            ½ كوب خل أبيض
            3 ملعقة كبيرة زيت
            1 ملعقة صغيرة ملح
            1 ملعقة صغيرة كمون
            2 ثوم مهروس
            1 ملعقة عصير ليمون حامضن.
                `,
            howTostart:' طريقه التحضير :',
                details : `في وعاء على النار ضعي الماء حتى الغليان.
                ضعي العدس لسلقه وغطي الوعاء واتركيه على نار هادئة.
                في هذه الأثناء قطّعي البصل.
                في وعاء آخر سخّني نصف الزيت واضيفي البصل لتقليته، وحمصيه لدرجة كبيرة أي يتحول للون البني الفاتح.
                ارفعي البصل من الوعاء.
                حمّصي الشعيرية بنفس الوعاء وقلبيها حتى تتحول للون الذهبي.
                اضيفي الماء واتركي الوعاء حتى غليان الماء.
                اضيفي الأرز ومرق الدجاج.
                بعد سلق العدس بالكامل صفيه من الماء واضيفيه على الأرز.
                خففي النار تحت وعاء الأرز وغطيه واتركيه حتى ينضج.
                لتحضير الصلصة
                في وعاء على النار سخّني الزيت ثم اضيفي الكمية المتبقية من البصل.
                اضيفي الثوم وقلّبي حتى يتحول الثوم والبصل للون الذهبي.
                اضيفي الطماطم بعد تقشيرها وضربها بالخلاط وقومي بالتقليب حتى يتم تسبيكها وتنهرس.
                اضيفي ½ ملعقة من الملح و½ ملعقة من الكمون ومعجون الطماطم وقومي بالتقليب حتى يتسبك هو أيضاً.
                اضيفي الماء مع مراعاة أن تكون الصلصة ثخينة.
                اتركي الوعاء على النار وغطيه حتى الغليان.
                في هذه الأثناء قومي بتحضير صلصة الدقة.
                في صحن عميق ضعى ½ ملعقة كمون و½ ملعقة ملح وعصير الليمون الحامض والخل والثوم وقومي بالتقليب.`
            ,link: 'https://youtu.be/RX6k_VjkM1M'
            },{ 
        img :'Images/طريقة_عمل_المسقعة_المصرية.jpg',
        nameOfmeal: 'مسقعه مصريه ',
        intgra:'المكونات :',
        disc:'كيلو ونصف من الباذنجان الرومي. قرنان من الفلفل الحار. ربع كيلو غرام من اللحمة المفرومة. كيلوغرام من الطماطم. ثلاث حبّات من البطاطا كبيرة الحجم. فصّان من الثوم. ملعقة كبيرة من الخل. رشّة من الملح. رشّة من الفلفل الاسود. رشّة من البابريكا. بصلة صغيره'
        ,howTostart:'طريقه التحضير :',
        details:'قشّر البطاطا ونقطّعها إلى شرائح في شكل أصابع ويتمّ قليها في الزيت، ثمّ نخرجها ونجهّز الباذنجان بغسله وتقطيعه وتركه في الماء مع الملح لفترة من الوقت، ثمّ تقلى في الزيت. نقطع الفلفل إلى شرائح ثم يقلي في الزيت، ثمّ نفرم الثوم بعد تقشيره ونقطع الطماطم إلى شرائح أو من الممكن عصر الطماطم، لتستعمل كعصير سائل، ثمّ نضع الثوم في الزيت المغلي ويقلب جيداً ليصبح لونه مائلاً للون الأصفر ويوضع عليه عصير الطماطم وإضافة التوابل. نترك المزيج قليلاً على النار وتضاف إليه شرائح الباذنجان، وشرائح البطاطا، والفلفل ومن الممكن إضافة شرائح بصل -حسب الرغبة-. يمكنك وضع الكزيج في الفرن قليلا حتّى تتسبك المكونات مع بعضها البعض ، ويفضّل تناولها من الأرز الأبيض',
        link:`https://www.youtube.com/watch?v=-2ZNg78q8yE`,
    },{
        img :'Images/0Hawawshi.jpg',
        nameOfmeal: ' حواوشي',
        intgra:'المكونات :',
        disc:`½ كيلو لحم مفروم
        250 غ دهن خروف
        بصلة وسط مفرومة ناعم
        2 فلفل اخضر
        رشة ملح
        رشة كمون
        رشة فلفل اسود
        2 حبهان
        ¼ كوب زيت
        2 فلفل اخضر
        5 أرغفة خبز`,
        howTostart:'طريقه التحضير :',
        details:`1. افرمي البصل ناعما جدا و اتركيه جانبا فى وعاء عميق .
        2. قطعى الفلفل قصطع صغيرة و ضيفيه بالوعاء على البصل .
        3. ضيفى الملح و الكمون و الحبهان و الفلفل .
        4. ضيفى اللحم المفروم و قومى برش قطعة من دهن الخروف على الخليط .
        5. قومى بالتقليب و الخلط جيدا لتمتزج كل المكونات معا .
        6. ادخلى الوعاء الثلاجة لمدة ساعة .
        7. احضرى الخبز بعد مرور الساعة و اصنعى فى كل خبز من الجانب فتحة صغيرة ادخلى من خلالها الحشو و افرديه داخل الرغيف .
        8. كررى الامر مع كل الارغفة الحشو .
        9. ادهنى الخبز من اعلى و من اسفل بالزيت .
        10. سخنى الفرن جيدا على نار متوسطة .
        11. رصى الخبز فى صينية و ادخليها الفرن على الشبكة و اتركيه حتى تمام النضج (من ربع لتلت ساعة) .
        12. يقدم الحواوشي ساخنا .`,
        link:'',    },
    {
        img :'Images/3eeegga.jpg',
        nameOfmeal: ' عجة البيض',
        intgra:'المكونات :',
        disc:`4 بيضات
        رشة ملح
        رشة بقدونس
        5 ملعقة كبيرة زيت أو زبدة
        1 مكعب مرق دجاج
        1 ملعقة صغيرة فلفل أسود
        رشة نعناع
        ¼ كوب بصل أخضر مفروم فرماً ناعماً
        2 حبة فلفل حلو مفرومة فرماً ناعماً`,
        howTostart:'طريقه التحضير :',
        details:`فى مقلاة غير لاصقة على النار، ذوبى الزبدة ثم أضيفى الخضار بعد تقطيعه ومكعب مرق الدجاج، قلبي المزيج.
        أضيفي الفلفل الاسود وقومي بتغطية المقلاة، استمري في الطهي على نار هادئة لمدة 5-10 دقائق مع التحريك من حين لآخر حتى تنضج الخضروات على البخار.
        `,
        link:'',    },
    {
        img :'Images/basbousa.jpg',
        nameOfmeal: 'البسبوسه ',
        intgra:'المكونات :',
        disc:`500 غرام سميد بسبوسة
        2 ملعقة كبيرة سمن مقدوح
        1 كوب زبادى
        1 بيضة
        1 ملعقة صغيرة بايكنغ بودر
        1 ملعقة صغيرة فانيليا
        `,
        howTostart:'طريقه التحضير :',
        details:`قومي بتجهيز السميد وأضيفي اليه السمن والفانيليا والبايكنغ بودر
        افركي الخليط بيدك جيدًا حتى يمتزج تماماً ويتشرب السمن.
        أضيفي القليل من الماء وقومي بالتقليب حتى يصبح قوام المزيج سميكاً، اتركيه جانبًا لمدة ربع ساعة
        بعد أن يتشرب السميد الماء، أضيفي كمية اخرى من الماء حتى تصلى للقوام المضبوط.
        ادهني صينية بالزبدة واسكبي بها الخليط ووزعيه بشكل متساوي.
        أدخلى الصينية الفرن حتى تنضج تماماً.
        أخرجي الصينية من الفرن بينما لا تزال ساخنة، اسكبي عليها فوراً القطر البارد ثم اتركيها حتى تبرد تماماً وقدميها.
        `,
        link:'',    },
    {
        img :'Images/frenchfries568.jpg',
        nameOfmeal:`بطاطس بالجبنه` ,
        intgra:'المكونات :',
        disc:`2 ملعقة كبيرة زيت زيتون
        4 فص ثوم مفروم
        ½ ملعقة صغيرة رقائق الفلفل الأحمر
        1 ملعقة صغيرة ملح
        1 ملعقة صغيرة فلفل أسود
        1 بطاطس مقطعة أصابع
        كوب جبن شيدر مبشور
        2 ملعقة كبيرة كريمة حامضة
        `,
        howTostart:'طريقه التحضير :',
        details:`في وعاء صغير، اخفقي زيت الزيتون مع الثوم، رقائق الفلفل الأحمر، الملح والفلفل.
        وزعي البطاطس في صينية الفرن المجهزة ثم اثني جميع جوانب ورق القصدير الأربعة.
        اسكبي خليط زيت الزيتون فوق البطاطس، اثني جوانب القصدير فوق البطاطس الودجز حتى تغطيها تماماً وأحكمي إغلاق الورق جيداً.
        ضعي الصينية في الفرن واخبزيها حتى تصبح البطاطس طرية، حوالي لمدة 30-35 دقيقة. رشي الجبن على الوجه ثم اشويها لمدة 2-3 دقائق، أو حتى يذوب الجبن تماماً وتصبح البطاطس مقرمشة.
        قدميها فوراً، وزينيها بالكريمة الحامضة.
        `,
        link:'',
    },
    {
        img :'Images/فطيرة فراخ.jpg',
        nameOfmeal: 'فطيرة فراخ ',
        intgra:'المكونات :',
        disc:`زيت الزيتون للقلي
        1 بصل مقطع شرائح
        2 فص ثوم مفروم
        3 كوب صدر دجاج ، مطبوخ ومقطع شرائح
        1 كوب معجون طماطم
        ملح حسب الذوق
        فلفل أسود حسب الذوق
        بقدونس مفروم حسب الذوق
        2 كوب حليب
        1 كوب زيت
        2 ملعقة كبيرة زبدة
        5 بيضات
        2 بطاطس مطهية، مهروسة
        2 كوب دقيق قمح
        1 ملعقة كبيرة بايكينج باودر
        1 كوب جبن كريمي برازيلي
        ½ 1 كوب جبن موزاريلا`,
        howTostart:'طريقه التحضير :',
        details:`في مقلاة، حمري البصل والثوم، ثم أضيفي الدجاج واطهيه حتى يصبح ذهبي اللون.
        أضيفي معجون الطماطم ثم تبليه بالملح، الفلفل والبقدونس المفروم. اتركي المزيج جانباً.
        في الخلاط، اخفقي الحليب مع الزيت، الزبدة، البيض والبطاطس المهروسة. انقلي الخليط إلى وعاء ثم أضيفي دقيق القمح والبايكينج باودر مع رشة من الملح.
        اسكبي نصف العجين في صحن فرن مدهون بالزبدة، ثم وزعي خليط الدجاج فوقه بالتساوي باستخدام ملعقة، ثم أضيفي الجبن الكريمي وجبن الموزاريلا.
        غطي الحشو بالعجين المتبقي ثم اخبزي الفطيرة في فرن مسخّن مسبقاً بدرجة حرارة 350 درجة فهرنهايت لمدة 30 دقيقة.
        `,
        link:'',    },
    {
        img :'Images/nodels.jpg',
        nameOfmeal: ' نودلز كوري ',
        intgra:'المكونات :',
        disc:`1 كوب بصل مفروم خشن
        8 أوقية مشروم، مفروم
        2 حبة مشروم بورتوبيللو، مغسول ومقطع إلى شرائح
        10 أوقية من نودلز الأرز، مسلوقة
        ¼ كوب من زيت السمسم
        ½ كوب من معجون الكاري الأحمر الحار
        ملح وفلفل حسب الرغبة
        إضافات اختيارية:
        2 ملعقة كبيرة تاماري
        4 حبة بصل أخضر، مفروم
        2 فص ثوم، مفروم
        `,
        howTostart:'طريقه التحضير :',
        details:`سخني زيت السمسم أولاً في مقلاة كبيرة. أضيفي البصل والمشروم بنوعيه.
        اقلي المزيج لمدة 4 دقائق تقريبًا. ثم أضيفي النودلز ومعجون الكاري الأحمر، ثم تبلي بالملح والفلفل. أضيفي الثوم المفروم والتاماري.
        استمري في الطهي لمدة أكثر من 8 دقائق على نار متوسطة، ثم رشي المزيج ببعض البصل الأخضر المفروم، ثم وزعي النودلز على أطباق التقديم وقدميها.
        `,
        link:'',    },
    {
        img :'Images/bakedscotcheggs.jpg',
        nameOfmeal: ' بيض مسلوم بلحم',
        intgra:'المكونات :',
        disc:`12 بيضة
        350 غ نقانق
        كمية من البقسماط المطحون
        ملعقة صغيرة ملح
        ملعقة صغيرة فلفل
        ملعقة صغيرة بابريكا`,
        howTostart:'طريقه التحضير :',
        details:`اسلقي 9 بيضات في كمية من الماء المغلي المالح لمدة 10 دقائق. ثم ضعيهم في الماء المثلج حتى تتوقف عن الطهي، قشريها.
        افتحي النقانق وازيلي الطبقة الشفافة.
        قسّمي لحم النقانق إلى 9 أجزاء، غلّفي كل بيضة بكمية من اللحم حتى تغطيه تماماً.
        اخفقي باقي البيض، وامزجي التوابل بالبقسماط المطحون.
        اغمسي البيض باللحم في البيض المخفوق ثم اغمسيه في مزيج البقسماط المطحون حتى يغطيه تماماً.
        ضعي البيض في صينية وادخليها الفرن لمدة 50 دقيقة على درجة حرارة 180 مئوية`,
        link:'',    },
    {
        img :'Images/addes soup.jpg',
        nameOfmeal: 'شربة العدس ',
        intgra:'المكونات :',
        disc:`2 كوب عدس (أحمر أو أصفر)
        5 ملعقة كبيرة زيت
        1 بصل كبير مفروم
        1 جزر مقشر ومقطع قطعاً صغيرة
        1 عرق كرفس مع الورق مقطع قطعاً صغيرة
        2 فص ثوم
        8 كوب مرق (دجاج أو لحم أو ضأن)
        1 ملعقة صغيرة كمون مطحون
        ملح و فلفل حسب الرغبة
        1 بصل صغير مقطع شرائح
        1 ملعقة كبيرة عصير ليمون
        `,
        howTostart:'طريقه التحضير :',
        details:`ضعي زيت الزيتون في وعاء على النار، واضيفي البصل والثوم وقلبيهم.
        اضيفي البطاطس وقلبيها قليلًا مع البصل والثوم.
        ضعي العدس في الوعاء مع الملح والفلفل الأسود وقلبيهم مع باقي المكونات.
        اضيفي الماء وقلبي المكونات قليلًا حتى تتفتح حبات العدس، وتنضج مكعبات البطاطس.
        اضيفي الكمون والشوفان، واتركي الشوربة تغلي لمدة 5 دقائق.
        اهرسي الشوربة بمحضرة الطعام أو الخلاط.`,
        link:'',    },

    ],
    
}
//  this code make a loop for map and but items in html
const meals = document.querySelector('.main');
let html = `` ; 
    for(var i = 0 ; i < list.item.length; i++){
        html += `
        <div class="container show" id="container" >
        <img src="${list.item[i].img}" alt="">
        <h1>${list.item[i].nameOfmeal}</h1>
        <p>
        ${list.item[i].intgra +'<br>'+ list.item[i].disc + '<br>'+ list.item[i].howTostart +'<br>'+ list.item[i].details }
        </p>
        <a href="${list.item[i].link}">شاهد فيديو</a>
    </div>

        `
        meals.innerHTML = html  ;
        }


    








